#-*- mode: org; mode: auto-fill -*-
#+STARTUP: showeverything
#+STARTUP: hidestars
#+TAGS: korean(k) SNU(S) CAPP(C) class(c)
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#DONT USE +COLUMNS: %25ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}

* Skype Development
** DONE Loopback Video w/H264
   DEADLINE: <2011-09-30 Fri>
   CLOCK: [2011-09-28 Wed 20:00]--[2011-09-28 Wed 21:42] =>  1:42
   CLOCK: [2011-09-28 Wed 15:22]--[2011-09-28 Wed 16:25] =>  1:03
   CLOCK: [2011-09-27 Tue 16:52]--[2011-09-27 Tue 18:12] =>  1:20
** TODO Webcam Capture and Encoding/Decoding with H/264

* Optical Flow/Motion Estimation
** TODO Investigate Similarities
   CLOCK: [2011-10-09 Sun 20:19]--[2011-10-09 Sun 21:13] =>  0:54
*** Overview
    Professor Lee wants me to see if there is some way to use optical
    flow, given the results of the H.264 motion estimation
    (i.e. the motion vector).  If possible, there should be a speedup
    associated with using precalculated results from the motion
    vector.

* Apartment
** TODO Pay the Rent
   DEADLINE: <2011-10-27 Thu ++1m -2d>
   - State "DONE"       from "TODO"       [2011-09-30 Fri 21:00]
   :PROPERTIES:
   :LAST_REPEAT: [2011-10-01 Sat 02:49]
   :END:

* Graphics Programming						  :SNU:class:
** DONE Project 1: Robot
   DEADLINE: <2011-09-29 Thu -1d>
   CLOCK: [2011-09-29 Thu 11:17]--[2011-09-29 Thu 13:50] =>  2:33
   CLOCK: [2011-09-29 Thu 01:28]--[2011-09-29 Thu 02:53] =>  1:25
   CLOCK: [2011-09-28 Wed 01:00]--[2011-09-28 Wed 03:05] =>  2:05
   CLOCK: [2011-09-25 Sun 22:35]--[2011-09-26 Mon 00:16] =>  1:41
   CLOCK: [2011-09-25 Sun 18:05]--[2011-09-25 Sun 19:39] =>  1:34

* Korean Study							     :korean:
** TODO Vocabulary Review
   SCHEDULED: <2011-10-08 Sat .+1d>
   - State "DONE"       from "TODO"       [2011-10-07 Fri 23:37]
   CLOCK: [2011-10-07 Fri 22:35]--[2011-10-07 Fri 23:00] =>  0:25
   CLOCK: [2011-10-03 Mon 01:18]--[2011-10-03 Mon 02:11] =>  0:53
   - State "DONE"       from "TODO"       [2011-10-01 Sat 19:46]
   CLOCK: [2011-10-01 Sat 18:52]--[2011-10-01 Sat 19:46] =>  0:54
   - State "DONE"       from "TODO"       [2011-09-27 Tue 23:45]
   CLOCK: [2011-09-27 Tue 19:42]--[2011-09-27 Tue 20:00] =>  0:18
   - State "DONE"       from "TODO"       [2011-09-25 Sun 17:03]
   CLOCK: [2011-09-25 Sun 17:01]--[2011-09-25 Sun 18:00] =>  0:59
   :PROPERTIES:
   :LAST_REPEAT: [2011-10-07 Fri 23:37]
   :END:
   Use Anki on my phone to review the words and phrases that are due
   today.

** TODO Study TOPIK Book
   SCHEDULED: <2011-10-06 Thu .+3d>
   - State "DONE"       from "TODO"       [2011-10-03 Mon 23:36]
   CLOCK: [2011-10-03 Mon 20:57]--[2011-10-03 Mon 21:41] =>  0:44
   CLOCK: [2011-10-03 Mon 13:35]--[2011-10-03 Mon 14:27] =>  0:52
   - State "DONE"       from "TODO"       [2011-10-03 Mon 00:40]
   CLOCK: [2011-10-02 Sun 22:48]--[2011-10-03 Mon 00:40] =>  1:52
   - State "DONE"       from "TODO"       [2011-09-27 Tue 16:36]
   CLOCK: [2011-09-26 Mon 15:19]--[2011-09-26 Mon 17:56] =>  2:37
   - State "DONE"       from "TODO"       [2011-09-23 Fri 17:12]
   CLOCK: [2011-09-23 Fri 16:37]--[2011-09-23 Fri 17:10] =>  0:33
   CLOCK: [2011-09-23 Fri 15:24]--[2011-09-23 Fri 16:25] =>  1:01
   :PROPERTIES:
   :LAST_REPEAT: [2011-10-03 Mon 23:36]
   :END:
   Try to read passages from the TOPIK book, understand them, and input
   new vocabulary into Anki for memorization.

** TODO Study Point Language Book
   SCHEDULED: <2011-10-12 Wed .+3d>
   - State "DONE"       from "TODO"       [2011-10-09 Sun 19:12]
   CLOCK: [2011-10-09 Sun 18:17]--[2011-10-09 Sun 19:12] =>  0:55
   :PROPERTIES:
   :LAST_REPEAT: [2011-10-09 Sun 19:12]
   :END:

* VLSI Seminar						     :SNU:CAPP:class:
** DONE My Adaboost HW Presentation
   DEADLINE: <2011-09-27 Tue -2d>
   CLOCK: [2011-09-26 Mon 13:55]--[2011-09-26 Mon 14:44] =>  0:49
   CLOCK: [2011-09-25 Sun 15:25]--[2011-09-25 Sun 16:57] =>  1:32
   CLOCK: [2011-09-24 Sat 17:43]--[2011-09-24 Sat 19:56] =>  2:13
   CLOCK: [2011-09-23 Fri 18:28]--[2011-09-23 Fri 22:22] =>  3:54
   CLOCK: [2011-09-23 Fri 03:14]--[2011-09-23 Fri 04:02] =>  0:48
*** Overview
    We are working in org-mode with LaTeX babel in order to create a
    cool and pretty presentation with minimal, manual LaTeX effort.
    This should also be an awesome way to learn both org-mode, and a
    little bit of *important* LaTeX, so that I can use the same setup
    later for more important things (like writing my thesis).

* Habbits
** TODO Morning Vitamin
   SCHEDULED: <2011-10-26 Wed 10:00 .+1d>
   - State "DONE"       from "TODO"       [2011-10-25 Tue 12:06]
   - State "DONE"       from "TODO"       [2011-10-24 Mon 12:43]
   - State "DONE"       from "TODO"       [2011-10-23 Sun 12:18]
   - State "DONE"       from "TODO"       [2011-10-17 Mon 21:34]
   - State "DONE"       from "TODO"       [2011-10-16 Sun 13:58]
   - State "DONE"       from "TODO"       [2011-10-15 Sat 14:05]
   - State "DONE"       from "TODO"       [2011-10-13 Thu 12:20]
   - State "DONE"       from "TODO"       [2011-10-12 Wed 10:02]
   - State "DONE"       from "TODO"       [2011-10-11 Tue 12:09]
   - State "DONE"       from "TODO"       [2011-10-09 Sun 14:51]
   - State "DONE"       from "TODO"       [2011-10-08 Sat 18:24]
   - State "DONE"       from "TODO"       [2011-10-07 Fri 13:53]
   - State "DONE"       from "TODO"       [2011-10-05 Wed 11:46]
   - State "DONE"       from "TODO"       [2011-10-03 Mon 11:44]
   - State "DONE"       from "TODO"       [2011-10-02 Sun 11:03]
   - State "DONE"       from "TODO"       [2011-10-01 Sat 11:38]
   - State "DONE"       from "TODO"       [2011-09-30 Fri 12:23]
   - State "DONE"       from "TODO"       [2011-09-28 Wed 13:05]
   - State "DONE"       from "TODO"       [2011-09-27 Tue 10:37]
   - State "DONE"       from "TODO"       [2011-09-26 Mon 11:41]
   - State "DONE"       from "TODO"       [2011-09-25 Sun 15:09]
   :PROPERTIES:
   :STYLE:    habit
   :LAST_REPEAT: [2011-10-25 Tue 12:06]
   :END:
** TODO Evening Vitamin
   SCHEDULED: <2011-10-23 Sun 22:00 .+1d>
   - State "DONE"       from "TODO"       [2011-10-22 Sat 22:26]
   - State "DONE"       from "TODO"       [2011-10-15 Sat 23:05]
   - State "DONE"       from "TODO"       [2011-10-13 Thu 23:54]
   - State "DONE"       from "TODO"       [2011-10-11 Tue 23:13]
   - State "DONE"       from "TODO"       [2011-10-09 Sun 23:45]
   - State "DONE"       from "TODO"       [2011-10-08 Sat 23:52]
   - State "DONE"       from "TODO"       [2011-10-07 Fri 23:37]
   - State "DONE"       from "TODO"       [2011-10-07 Fri 00:30]
   - State "DONE"       from "TODO"       [2011-10-04 Tue 00:15]
   - State "DONE"       from "TODO"       [2011-10-03 Mon 00:53]
   - State "DONE"       from "TODO"       [2011-10-01 Sat 23:03]
   - State "DONE"       from "TODO"       [2011-10-01 Sat 02:48]
   - State "DONE"       from "TODO"       [2011-09-29 Thu 01:27]
   - State "DONE"       from "TODO"       [2011-09-27 Tue 23:37]
   - State "DONE"       from "TODO"       [2011-09-26 Mon 22:37]
   - State "DONE"       from "TODO"       [2011-09-25 Sun 22:34]
   :PROPERTIES:
   :STYLE:    habit
   :LAST_REPEAT: [2011-10-22 Sat 22:26]
   :END:
